; domain
(define (domain manito)
    (:requirements :strips)

    (:predicates 
        (en ?bloque ?donde)
        (pos ?garra ?donde)

        (libre ?quien)
        (apilado ?bloque)
        (dismover ?garra)
        (pinned ?garra)

        (torre ?debajo ?sobre)

        (pisog ?garra ?altura)
        (pisob ?bloque ?altura)

        (ocupado ?garra)
        (desocupado ?garra)
        
        (camino ?donde ?hasta)
        (alt ?al1 ?al2))


    (:action movehorizontal
        :parameters (?garra ?donde ?hasta)
        :precondition (and
            (pos ?garra ?donde)
            (camino ?donde ?hasta)
            (dismover ?garra)
        )
        :effect (and
            (pos ?garra ?hasta)
            (not (pos ?garra ?donde))
        )
    )

    (:action moverarriba
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (pinned ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (pinned ?garra))
            (dismover ?garra)
        )
    )

     (:action moverabajo
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (dismover ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (dismover ?garra))
            (pinned ?garra)
        )
    )

    (:action tomar
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (desocupado ?garra)
            (libre ?bloque)
        )
        :effect (and
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            (libre ?donde)
            (libre ?bloque)
        )
    )

    (:action soltar 
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (pisog ?garra ?alt)
            (ocupado ?garra)
            (libre ?donde)
        )
        :effect (and
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            (not (libre ?donde))
        )
    )

    
    (:action desapilar
        :parameters (?garra ?bloque ?donde ?alt ?bloque2)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (pisob ?bloque2 ?alt)
            
            (desocupado ?garra)

            (libre ?bloque)
            (apilado ?bloque2)
            (torre ?bloque2 ?bloque)
            )
            
            :effect (and
            (not (torre ?bloque2 ?bloque))
            (not (libre ?bloque))
            (not (apilado ?bloque2))
            (libre ?bloque2)
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            )
    )

    (:action apilar
        :parameters (?garra ?bloque ?bloque2 ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque2 ?alt)
            
            (ocupado ?garra)
            (libre ?bloque2)
            )
            
            :effect (and
            (torre ?bloque2 ?bloque)
            (libre ?bloque)
            (apilado ?bloque2)
            (not (libre ?bloque2))
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            )
    )
)

; problem
(define (problem goal3)
    (:domain manito)

    (:objects
        greenb blueb redb whiteb
        garra
        xygarra xygreen xyblue xyred xywhite
        zgreen zgarra zblue zred zwhite
    )

    (:init
        (en greenb xygreen)
        (pisob greenb zgreen)
        (libre greenb)

        (en blueb xyblue)
        (pisob blueb zblue)
        (libre blueb)

        (en redb xyred)
        (pisob redb zred)
        (libre redb)

        (en whiteb xywhite)
        (pisob whiteb zwhite)
        (libre whiteb)

        (pos garra xygarra)
        (pisog garra zgarra)

        (dismover garra)
        (desocupado garra)

        (camino xygreen xygarra)
        (camino xygarra xygreen)
        (camino xygarra xyblue)
        (camino xyblue xygarra)
        (camino xygarra xyred)
        (camino xyred xygarra)
        (camino xygarra xywhite)
        (camino xywhite xygarra)

        (alt zgarra zgreen)
        (alt zgreen zgarra)
        (alt zblue zgarra)
        (alt zgarra zblue)
        (alt zred zgarra)
        (alt zgarra zred)
        (alt zwhite zgarra)
        (alt zgarra zwhite)
    )

    (:goal 
        (and 
            (torre blueb greenb)
            (torre whiteb redb)
        )
    )
)

; plan
1. (movehorizontal garra xygarra xyred)
   deleted: (pos garra xygarra)
   added: (pos garra xyred)
   goals met: 0 of 2
2. (moverabajo garra zgarra zred)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zred) (pinned garra)
   goals met: 0 of 2
3. (tomar garra redb xyred zred)
   deleted: (desocupado garra) (en redb xyred) (pisob redb zred)
   added: (ocupado garra) (en redb garra) (libre xyred)
   goals met: 0 of 2
4. (moverarriba garra zred zgarra)
   deleted: (pisog garra zred) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 0 of 2
5. (movehorizontal garra xyred xygarra)
   deleted: (pos garra xyred)
   added: (pos garra xygarra)
   goals met: 0 of 2
6. (movehorizontal garra xygarra xywhite)
   deleted: (pos garra xygarra)
   added: (pos garra xywhite)
   goals met: 0 of 2
7. (moverabajo garra zgarra zwhite)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zwhite) (pinned garra)
   goals met: 0 of 2
8. (apilar garra redb whiteb xywhite zwhite)
   deleted: (libre whiteb) (ocupado garra) (en redb garra)
   added: (torre whiteb redb) (apilado whiteb) (desocupado garra) (en redb xywhite) (pisob redb zwhite)
   goals met: 1 of 2
9. (moverarriba garra zwhite zgarra)
   deleted: (pisog garra zwhite) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 1 of 2
10. (movehorizontal garra xywhite xygarra)
   deleted: (pos garra xywhite)
   added: (pos garra xygarra)
   goals met: 1 of 2
11. (movehorizontal garra xygarra xygreen)
   deleted: (pos garra xygarra)
   added: (pos garra xygreen)
   goals met: 1 of 2
12. (moverabajo garra zgarra zgreen)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zgreen) (pinned garra)
   goals met: 1 of 2
13. (tomar garra greenb xygreen zgreen)
   deleted: (desocupado garra) (en greenb xygreen) (pisob greenb zgreen)
   added: (ocupado garra) (en greenb garra) (libre xygreen)
   goals met: 1 of 2
14. (moverarriba garra zgreen zgarra)
   deleted: (pisog garra zgreen) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 1 of 2
15. (movehorizontal garra xygreen xygarra)
   deleted: (pos garra xygreen)
   added: (pos garra xygarra)
   goals met: 1 of 2
16. (movehorizontal garra xygarra xyblue)
   deleted: (pos garra xygarra)
   added: (pos garra xyblue)
   goals met: 1 of 2
17. (moverabajo garra zgarra zblue)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zblue) (pinned garra)
   goals met: 1 of 2
18. (apilar garra greenb blueb xyblue zblue)
   deleted: (libre blueb) (ocupado garra) (en greenb garra)
   added: (torre blueb greenb) (apilado blueb) (desocupado garra) (en greenb xyblue) (pisob greenb zblue)
   goals met: 2 of 2
